TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_УдостоверенияКачестваПоРегистрацииПЛК/гкс_УдостоверенияКачестваПоРегистрацииПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_УдостоверенияКачестваПоРегистрацииПЛК</name>
  <comment>Данные удостоверения качества и безопасности для документа Регистрация на ПЛК (при приёмке ЖД-транспортом контролируемой номенклатуры)</comment>
  <resources>
    <name>НомерУдостоверения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУдостоверения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыработкиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыработкиКонец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_УдостоверенияКачестваПоРегистрацииПЛК/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПарамерыЗаполнены(Параметры, Запись) Тогда
		Запись.ДокументРегистрации = Параметры.ЗначенияЗаполнения.ДокументРегистрации;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокХраненияМесяцевПриИзменении(Элемент)
	ЗаполнитьСрокГодности();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыработкиКонецПриИзменении(Элемент)
	ЗаполнитьСрокГодности();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаКлиенте
Процедура ЗаполнитьСрокГодности()
	СекундВДне = гкс_ОбщегоНазначенияКлиентСервер.СекундВДне();
	Если ЗначениеЗаполнено(Запись.ДатаВыработкиКонец) И ЗначениеЗаполнено(Запись.СрокХраненияМесяцев) Тогда 
		Запись.СрокГодности = 
			ДобавитьМесяц(Запись.ДатаВыработкиКонец, Запись.СрокХраненияМесяцев) - СекундВДне;
	КонецЕсли;	                                     
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПарамерыЗаполнены(Параметры, Запись)
	Возврат Параметры.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
		И Параметры.ЗначенияЗаполнения.Свойство("ДокументРегистрации")
		И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ДокументРегистрации)
		И Не ЗначениеЗаполнено(Запись.ДокументРегистрации); 
КонецФункции

#КонецОбласти
